[View in Colaboratory](https://colab.research.google.com/github/neoaksa/Pandas-Matplotlib/blob/master/Pandas.ipynb)

**Process of data manipulation:**


1.   Ideation
2.   retrieval
3.   preperation
    * integrate data
    * aggreation
    * missing or incorrect
    * format diffence
4.   exploration
    * distributed
    * outliers
    * quick visualization
    * quick models
    * feature relationship
5.   model
6.   presentation
7.   reproduction

In [3]:
import pandas as pd
# series is like np.arry, but it has index
s1 = pd.Series([1,2,3],index =['a','b','c'])
s1

<bound method Series.mean of a    1
b    2
c    3
dtype: int64>

a    1
b    2
c    3
dtype: int64

Pandas can access lots of file formats, incuding CSV, Json, excel, Html,h5 or connect to SQL:


*   pd.read_csv('filename.csv', index_col=0,dtype={'col:np.float64'}, name=[...],usecols=[....],skiprows=[...],skpfooter=n, header=0)
*   df.to_csv
*   pd.read_excel()
*   pd.read_jason
*   pd.read_html
*   pd.HDFStore
*   df.read_sql('sql',connect,index=[...])

In [65]:
# dataframe is like table in SQL
df1 = pd.read_csv('http://samplecsvs.s3.amazonaws.com/Sacramentorealestatetransactions.csv',
                 index_col=['latitude','longitude'])
# rename columns
df1.rename(columns={'street':'str'},inplace=True)
# search data
df1.loc[:,['str']] # get col street
df1.iloc[0:3]  # retrive top 3 row
selection = df1.price >60000
df1[selection].head(3) # select price more than 60000

,,str,city,zip,state,beds,baths,sq__ft,type,sale_date,price
latitude,longitude,,,,,,,,,,
38.478902,-121.431028,51 OMAHA CT,SACRAMENTO,95823,CA,3,1,1167,Residential,Wed May 21 00:00:00 EDT 2008,68212
38.618305,-121.443839,2796 BRANCH ST,SACRAMENTO,95815,CA,2,1,796,Residential,Wed May 21 00:00:00 EDT 2008,68880
38.616835,-121.439146,2805 JANETTE WAY,SACRAMENTO,95815,CA,2,1,852,Residential,Wed May 21 00:00:00 EDT 2008,69307

*  .loc[]Looks up by the label, not the location. But be careful; if the labels are integers, then integers will be treated as labels!
*  .at[]Like .loc[], but this can only retrieve a single value.
*  .iloc[]Lookup is based on the 0-based position and not the index label.
*  .ix[]Hybrid, which when given an integer will attempt 0-based lookup; other types are label-based. This is going to be deprecated, so stick with the other three properties.

In [66]:
# index
df1 = df1.reset_index() # reset index
df1.set_index(['latitude','longitude'],inplace=True) # reset index
df1.describe()
# bin price column
df1['price_bin'] = pd.cut(df1['price'],(0,145000,213750,300000,900000),labels=[1,2,3,4])
df1['price_bin2'] = pd.qcut(df1['price'],5) # equally bin
# unique, nunique 
df1 = df1.reset_index()
df1['state'].unique()  # distinct value
df1.sort_values(by=['price'],ascending=False).head(3) # sort value by price

,,str,city,zip,state,beds,baths,sq__ft,type,sale_date,price
latitude,longitude,,,,,,,,,,
38.415298,-121.194858,9401 BARREL RACER CT,WILTON,95693,CA,4,3,4400,Residential,Fri May 16 00:00:00 EDT 2008,884790
38.706692,-121.058869,2982 ABERDEEN LN,EL DORADO HILLS,95762,CA,4,3,0,Residential,Fri May 16 00:00:00 EDT 2008,879000
38.813337,-121.133348,3935 EL MONTE DR,LOOMIS,95650,CA,4,4,1624,Residential,Tue May 20 00:00:00 EDT 2008,839000

In [96]:
# some simple stats functions
import numpy as np
df1.iloc[2,3]=np.NaN
df1.count()  # won't count NaN
df1.isnull().sum() # count NaN
df1.describe() # boxplot 
df1.var()
df1.std()
df1['price'].cov(df1['sq__ft'])
df1.cov() # covericance matrix
df1.corr() # corrlation matrix
df1['price'].pct_change() # percetage change
r = df1['price'].rolling(window=5) # rolling object
r.sum().head(2) # sum of rolling 5 records.

latitude   longitude
38.631913  -121.434879   NaN
38.478902  -121.431028   NaN
Name: price, dtype: float64

In [0]:
# Tidying data
df1.dropna(how='any', axis=0,thresh =5) # drop any na with setting thresh = 5
df1.fillna(0) # fill na with zero
df1.fillna(df.mean()) # fill na with mean of each column
df1.duplicated()
df1.replace(np.NaN,'')  # replace Nan with ''
df1['price'] = df1['price'].apply(lambda x:(x/1000)) # apply price/1000

Pandas can achieve most SQL features:

1.  **select** top n [colname] from table 

     df['colname'].head(n)

2.  select top n [col1] from table **where** col2 = 'condition' and col3 > 5 or col4 is  not null

     df[(df['col2']=='condition)' & (df['col3']>5) | (df['col4'].notna()) ].head(n)

3.  select col1, avg(col2),count(\*) from table  **group by**  col1,col3

     df.groupby(['col1','col3']).agg('col2':np.mean,'col1':np.size)

4.  select * from df1 **inner join** df2 on df1.col1 = df2.col1

      pd.merge(df1,df2, on = 'col1')

      select * from df1 **left outer join** df2 on df1.col1=df2.col2
      
      pd.merge(df1,df2,on='col1', how='left') # right outter join = right, full join = outer
      
5.   **Union**
      
      pd.concat([df1,df2])
      
      pd.concat([df1,df2]).drop_duplicates
      
6.  select * from (
select t.\*, **row_number() over(partition** by col1 order by col2 desc) as rn from table t) where rn<3 order by col1,rn
  
        (df.assign(rn=df.sort_values(['col2'],asceding=False)
                            .groupby(['col1'])
                            .cumcount()+1)
            .QUERY('RN<3')
            .SORT_VALUES(['COL1','RN'])
        )
    
      or 
      
    (df.assign(rn=df.groupby(['col1'])['col2'].rank(method='first',ascending=False))
            .QUERY('RN<3')
            .SORT_VALUES(['COL1','RN'])
        )
      
7.  **update , delete**
pandas use  equvlanet to assign new value to a new object
     
     update table set col1=col\*2 where col2='condition'
     
     df.loc[df['col2']=='condition','col1'] \*=2
     
     delete from table where col > 'condition'
     
     dfnew = df.loc[df['col'] <=  condition]
     
8. Others

add new row
    
    * df.append(row)
    
pivot and melt

    * df.pivot(index='',column='',value='')
    * pd.melt(df, id_vars=[],value_vars=[]) # unpivot
    
 stack and unstake
 
	* df1.stack()  # this will put the column on row
	* df1.unstack(level = 0) # unstack the row into column